Tekla Open API Reference for Tekla Structures 2025
Parallel.LineSegmentToLineSegment Method
Overload List
Name | Description
LineSegmentToLineSegment(LineSegment, LineSegment)
 Returns true if the given line segments are parallel.
LineSegmentToLineSegment(LineSegment, LineSegment, Double)
 Returns true if the given line segments are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace